OpenFOAM-2112/fishpassage-M1-DES/0.model/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
    }
    outlet
    {
        type            codedMixed;
        refValue        uniform 0;
        refGradient     uniform 0;
        valueFraction   uniform 0;

        name            fixedWaterPressure;   // name of generated BC

        code
        #{
            const scalarField rhop = patch().lookupPatchField<volScalarField, scalar>("rho");
            const scalarField alpha = patch().lookupPatchField<volScalarField, scalar>("alpha.water");
            this->refValue() = rhop * 9.81 * 1.2;
            this->refGrad() = Zero;
            this->valueFraction() = alpha;
        #};
    }
    fixedWalls
    {
        type            fixedFluxPressure;
    }
    atmosphere
    {
        type            totalPressure;
        p0              uniform 0;
    }
}

// ************************************************************************* //
