OpenFOAM-2112/fishpassage-M1-DES/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    location "constant";
    object transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water {
    transportModel Newtonian;
    nu 1.20e-06;
    rho 1000;
}

air {
    transportModel Newtonian;
    nu 1.48e-05;
    rho 10;
}

sigma 0;

// ************************************************************************* //